<?php

return [
    'forget_password' => [
        'mail' => [
            'subject' => 'تعين كلمة مرور جديدة',
        ],
        'messages' => [
            'success' => 'تم ارسال تعين كلمة المرور الجديدة بنجاح عبر البريد الالكتروني',
        ],
    ],
    'login' => [
        'donor_login' => ' دخول المتبرعين',
        'donor_login_welcome' => 'أهلا بك، يمكنك تسجيل الدخول من هنا',
        'donor_register' => 'انشاء حساب متبرع',
        'donor_welcome' => 'اهلا بك، يمكنك  انشاء حساب جديد  من هنا',
        'title' => 'تسجيل الدخول او انشاء حساب',
        'message' => [
            'login_success' => 'تم تسجيل الدخول بنجاح'
        ],
        'form' => [
            'btn' => [
                'login' => 'تسجيل الدخول',
                'forget_password' => 'نسيت كلمة المرور؟',
            ],
            'email' => 'البريد الالكتروني',
            'password' => 'كلمة المرور',
            'remember_me' => 'تذكرني',
        ],
        'routes' => [
            'index' => 'تسجيل الدخول',
        ],
        'validations' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'failed' => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password' => [
                'min' => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
        ],
    ],
    'register' => [
        'title' => 'تسجيل الدخول او انشاء حساب',
        'message' => [
            'registered_success' => 'تم التسجيل بنجاح'
        ],
        'mail' => [
            'subject' => 'تأكيد الحساب',
            'button_content' => 'تأكيد الحساب',
            'header' => 'أنت تتلقي هذا البريد الإلكتروني لتأكيد حسابك',
        ],
        'form' => [
            'btn' => [
                'register' => ' مستخدم جديد',
            ],
            'email' => 'البريد الالكتروني',
            'phone' => 'رقم الهاتف ',
            'name' => 'الإسم ',
            'password' => 'كلمة المرور',
            'password_confirmation' => 'تأكيد كلمة المرور',
        ],
        'routes' => [
            'index' => 'تسجيل الدخول',
        ],
        'validations' => [
            'email' => [
                'email' => ' من فضلك ادخل البريد بشكل صحيح ',
                'required' => ' من فضلك ادخل البريد الالكتروني ',
                'unique' => ' البريد الإلكتروني مسجل بالفعل ',
            ],
            'name' => [
                'required' => 'الرجاء إدخال الإسم',
            ],
            'phone' => [
                'required' => ' الرجاء إدخال رقم الهاتف ',
                'digits_between' => ' يجب ان يكون الرقم مكون من 8 ارقام ',
                'unique' => ' رقم الهاتف مسجل بالفعل ',
            ],
            'password' => [
                'min' => ' كلمة المرور يجب ان تكون اكثر من ٦ مدخلات ',
                'required' => ' يجب ان تدخل كلمة المرور ',
                'confirmed' => ' كلمة المرور غير مشابهة لتأكيد كلمة المرور ',
            ],
            'failed' => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',

        ],
    ],
    'reset' => [
        'mail' => [
            'button_content' => 'تعين كلمة مرور جديدة',
            'header' => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعين كلمة مرور جديدة لفقدانك القديمة',
            'subject' => 'تعين كلمة مرور جديدة',
        ],
        'reset' => 'تعيين',
        'title' => 'تعين كلمة مرور جديدة',
        'send_verification' => 'إرسال رساله تأكيد',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password' => [
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'token' => [
                'exists' => 'انتهت صلاحية هذا الطلب',
                'required' => 'لا تملك صلاحية تعين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
    ],
];
